
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() Тогда
		Элементы.ФормаЗаполнить.Видимость = Ложь;	
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере()
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбъектДокумент = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.ВКМ_ВыплатаЗарплаты"));
	ОбъектДокумент.ВыполнитьЗаполнение();
	ЗначениеВРеквизитФормы(ОбъектДокумент,"Объект");
	
КонецПроцедуры



