//АШ Вывод на форму новых реквизитов договора, если выбран соответствующий вид договора

// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

		Если Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") = Неопределено Тогда
			
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
			НовыйЭлемент.Заголовок = "Дата начала действия договора";
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;
		
		Если Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора") = Неопределено Тогда
			
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
			НовыйЭлемент.Заголовок = "Дата окончания действия договора";
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;
		
			
		Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
			
			НовыйЭлемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
			НовыйЭлемент.Заголовок = "Сумма абонентской платы";
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;
			
		Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
			
			НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
			НовыйЭлемент.Заголовок = "Стоимость часа работы";
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
					
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
		Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
			Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
			Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
			Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
			Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
		Иначе
			Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
			Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
			Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
			
		КонецЕсли;

КонецПроцедуры

#КонецОбласти

//Конец АШ