// @strict-types

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

   ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
   ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВыполненныеКлиентуРаботы
	Движения.ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Организация,
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы,
		|	ДоговорыКонтрагентов.Представление
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать() ;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Дата >= ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалаДействияДоговора И
			Дата <= ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДействияДоговора И
			ВыборкаДетальныеЗаписи.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание	Тогда
		
			Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
				Движение = Движения.ВыполненныеКлиентуРаботы.Добавить();
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = 
					ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
					
			КонецЦикла;
	
		КонецЕсли;
		
	КонецЦИкла;
		

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	//Если новый документ, то создаем запись в справочнике ВКМ_УведомленияТелеграмБоту
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда  
				
		Сообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Сообщение.ТекстСообщения = СтрШаблон("Создан новый документ Обслуживание клиента № %1, дата %2", 
			Номер, Дата);
		Сообщение.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти