// @strict-types

#Область ПрограммныйИнтерфейс

Процедура ОтправитьСообщенияВТелеграм() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК СсылкаНаУведомление
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТелеграмБотСообщение(ВыборкаДетальныеЗаписи.ТекстСообщения) Тогда
			
		Уведомление = ВыборкаДетальныеЗаписи.СсылкаНаУведомление.ПолучитьОбъект();
		Уведомление.Удалить();

		КонецЕсли;

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры


// Отправка запроса на сервер api.telegram.org
// 
// Параметры:
//  ТекстСообщения 
// Возвращаемое значение:
//  Булево, Число - ВКМ_Телеграм бот сообщение

Функция ТелеграмБотСообщение(ТекстСообщения) Экспорт
	
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	
	СтрокаЗапроса = СтрШаблон("/bot%1/sendMessage", Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить());
	
	//Устанавливаем структуру - тело HTTP-запроса
	ТелоОбъекта = Новый Структура;
	ТелоОбъекта.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
	ТелоОбъекта.Вставить("text", ТекстСообщения);
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, ТелоОбъекта);
	ТелоЗапроса = Запись.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", ОбщегоНазначенияHTTP.ТипКонтентаJSON());
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос); //Отправляем запрос методом POST
	
	Если Ответ.КодСостояния = 200 Тогда
		
		Возврат Ответ.КодСостояния;
	
	Иначе
		СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия");
		СтруктураСобытий.ИмяСобытия = СтрШаблон("Информация ""%1"" не отправлена в группу телеграм", ТекстСообщения);
		СтруктураСобытий.ПредставлениеУровня = "Предупреждение"; //Информация, Ошибка, Предупреждение, Примечание
		СтруктураСобытий.Комментарий = "Запустите отправку данных в ТГ вручную";
		СтруктураСобытий.ДатаСобытия = ТекущаяДата();
		
		СобытияДляЖурналаРегистрации = Новый СписокЗначений();
		СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
