// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Месяц = Формат(Объект.Период, "ДФ = ""ММММ гггг""");
	
	Если Год(Объект.Период) = 1 Тогда
		
		СформироватьСписокВыбораМесяца(Год(ТекущаяДата()));
		
	Иначе
		
		СформироватьСписокВыбораМесяца(Год(Объект.Период));
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГода(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
	    Возврат;
	    
	Иначе
	    
	    Месяц = Результат.Значение;
	
	КонецЕсли;
		
	Если Месяц <> "" Тогда
    
        Если СтрДлина(Месяц)=4 Тогда 
    
            СформироватьСписокВыбораМесяца(Число(Месяц));
	
	    Оповещение = новый ОписаниеОповещения("ПослеВыбораГода", ЭтотОбъект);
	    
	    ПоказатьВыборИзМеню(Оповещение, Элементы.Месяц.СписокВыбора, Элементы.Месяц);
			
        Иначе
            
            НомерМесяца = (Найти("янвфевмарапрмайиюниюлавгсеноктноядек",Нрег(Лев(Месяц,3)))+2)/3; //получаем номер месяца
            
            ВыбрГод = Число(Прав(Месяц, 4));
            
            Объект.Период = НачалоМесяца(Дата(ВыбрГод, НомерМесяца, 1));
            
        КонецЕсли;
            
    КонецЕсли;	
	
	Сообщить("Период", Объект.Период);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	
	Если Месяц <> "" Тогда
		
		Если СтрДлина(Месяц) = 5 Тогда
			
			СформироватьСписокВыбораМесяца(Число(Месяц));
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораГода", ЭтотОбъект);
			ПоказатьВыборИзМеню(Оповещение, Элементы.Месяц.СписокВыбора, Элементы.Месяц);
			
		Иначе
			
			//получаем номер месяца")
			НомерМесяца = (Найти("янвфевмарапрмайиюниюлавгсеноктноядек",Нрег(Лев(Месяц,3)))+2)/3;
			ВЫбрГод = Число(Прав(Месяц, 4));
			 Объект.Период = НачалоМесяца(Дата(ВыбрГод, НомерМесяца, 1));
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументыРеализации(Команда)
	
	// 1. Запуск фонового задания на сервере.
 	ДлительнаяОперация = НачатьСозданиеДокументовРеализацииНаСервере();
 
	 // 2. Подключение обработчика завершения фонового задания.
 	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
 	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриЗавершенииСозданияДокументовРеализации", ЭтотОбъект);
 	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьСписокВыбораМесяца(Год)

	Элементы.Месяц.СписокВыбора.Очистить();
	Элементы.Месяц.СписокВыбора.Добавить(Формат(Год-1,"чг=0"));
	
	Для М = 1 По 12 Цикл
		
		СформированнаяДата = Дата(Год, М, 1);
		ИмяМесяца = Формат(СформированнаяДата, "ДФ = ""ММММ гггг""");
		Элементы.Месяц.СписокВыбора.Добавить(ИмяМесяца);
		
	КонецЦикла;
		
		Элементы.Месяц.СписокВыбора.Добавить(Формат(Год + 1,"чг=0"));
		
КонецПроцедуры


&НаСервере
Функция НачатьСозданиеДокументовРеализацииНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();//УникальныйИдентификатор);
 	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
 		"Обработки.МассовоеСозданиеАктов.ВыполнитьМассовоеСозданиеАктов", Объект.Период);
	
КонецФункции


&НаКлиенте
Процедура ПриЗавершенииСозданияДокументовРеализации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
 
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
 
	// Период = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
 	//УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	 //УстановитьНастройкиУчетнойЗаписи(Настройки);
	
КонецПроцедуры

#КонецОбласти
